In [1]:
import psycopg2 as ps
import pandas as pd

In [2]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}

In [3]:
purchases = pd.DataFrame(data)

In [4]:
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [5]:
purchases.loc[2]

apples     0
oranges    7
Name: 2, dtype: int64

In [6]:
purchases_df = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])

In [7]:
purchases_df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [8]:
purchases_df['apples']

June      3
Robert    2
Lily      0
David     1
Name: apples, dtype: int64

In [9]:
purchases.loc[1:2]

   apples  oranges
1       2        3
2       0        7

In [10]:
v = purchases_df['apples']

In [11]:
type(v)

pandas.core.series.Series

In [12]:
z = purchases_df[['apples']]

In [13]:
type(z)

pandas.core.frame.DataFrame

In [14]:
v

June      3
Robert    2
Lily      0
David     1
Name: apples, dtype: int64

In [15]:
z

        apples
June         3
Robert       2
Lily         0
David        1

## Importing data as a Dataframe

#### As CSV

In [16]:
imdb_df = pd.read_csv("IMDB_Data.csv", index_col='Rank')

In [17]:
type(imdb_df)

pandas.core.frame.DataFrame

In [18]:
imdb_df.head(2)

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Rank,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0

In [19]:
imdb_df.loc[1]

Title                                           Guardians of the Galaxy
Genre                                           Action,Adventure,Sci-Fi
Description           A group of intergalactic criminals are forced ...
Director                                                     James Gunn
Actors                Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...
Year                                                               2014
Runtime (Minutes)                                                   121
Rating                                                              8.1
Votes                                                            757074
Revenue (Millions)                                               333.13
Metascore                                                            76
Name: 1, dtype: object

In [20]:
imdb_df.columns

Index(['Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [21]:
des = imdb_df[['Description', 'Title']]

In [22]:
type(des)

pandas.core.frame.DataFrame

In [23]:
des.head(2)

,Description,Title
Rank,,
1,A group of intergalactic criminals are forced ...,Guardians of the Galaxy
2,"Following clues to the origin of mankind, a te...",Prometheus

In [24]:
rows = imdb_df.loc[6:10]

In [25]:
type(rows)

pandas.core.frame.DataFrame

In [26]:
col = imdb_df[['Title']]

In [27]:
type(col)

pandas.core.frame.DataFrame

In [28]:
rows4 = col.loc[4:10]

In [29]:
type(rows4)

pandas.core.frame.DataFrame

In [30]:
rows4

                   Title
Rank
4                   Sing
5          Suicide Squad
6         The Great Wall
7             La La Land
8               Mindhorn
9     The Lost City of Z
10            Passengers

In [31]:
imdb_df.columns

Index(['Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

#### instead of 'Title' convert to 'title' also remove the spaces and () to revenue_millions

In [45]:
json_df = pd.read_json("https://jsonplaceholder.typicode.com/posts")

In [46]:
json_df.head(2)

,body,id,title,userId
0,quia et suscipit\nsuscipit recusandae consequu...,1,sunt aut facere repellat provident occaecati e...,1
1,est rerum tempore vitae\nsequi sint nihil repr...,2,qui est esse,1

In [42]:
x=3
x = x + 5
x

8

In [43]:
y = 3
y += 5
y

8

In [47]:
# json_df = json_df.set_index('id')
json_df.set_index('id', inplace=True)

In [48]:
json_df.head(2)

,body,title,userId
id,,,
1,quia et suscipit\nsuscipit recusandae consequu...,sunt aut facere repellat provident occaecati e...,1
2,est rerum tempore vitae\nsequi sint nihil repr...,qui est esse,1

In [ ]:
!pip install psycopg2

In [63]:
import psycopg2 as ps

In [60]:
con = ps.connect("host=localhost user=postgres password=123456 dbname=sales_demo_jan")

In [66]:
inv_df = pd.read_sql("select * from sales as s join inventories as i on s.inv_id = i.id join stock as st on st.inv_id = i.id  ", con)

In [67]:
inv_df.head(2)

,id,inv_id,quantity,created_at,id,name,bp,sp,type,id,inv_id,stock,created_date
0,1,2,9.0,2013-04-29,2,Seedlings - Clamshell,54.0,64.8,veggies,73,2,113.0,2009-04-25
1,1,2,9.0,2013-04-29,2,Seedlings - Clamshell,54.0,64.8,veggies,63,2,112.0,2016-01-21